'''
Классы ядра
'''

import numpy as np


class MetricBase:
    '''
    Базовый класс для Класс-функций расчета метрики по набору данных.
    '''
    # self.comp_func=min


    def __init__(self, comp_func=min, **kwargs):
        '''

        `comp_func`: function
            Функция по которой происходит сравнение двух метрик методом compare.
            По умолчанию выбирается минимальная.

        `**kwargs`:
            Основные настройки объекта.

            В наиболее общем случае - функция np.mean,
            которая будет отвечать за расчет значения

            Пользователь может указать собственную функцию.
        '''
        self.comp_func=comp_func

    def __call__(self, state, area=None, **kwargs):
        '''
        `state` (`состояние`): abstract
            Абстрактный объект состояния среды.
            Например, словарь времен прибытия в разные точки.

        `**kwargs`:
            Прочие данные которые используются для вычислений.
            Например, частные настройки алгоритма, дополнительные данные и т.д.

        # Возвращает
        `metric` (`значение метрики`): abstract
            значение метрики
        '''
        return None

    # @classmethod
    def compare(self, a, b):
        '''
        Сравнение.       
        Возвращает значение в соответствии с логикой расчетов.
        '''
        if a==b:
            return None
        if a is None and b is None:
            return None
        if a is None:
            return b
        if b is None:
            return a
        return self.comp_func(a, b)


class StateBase():
    '''
    Базовый класс для класс-функций расчета состояния среды.

    Лес Вороного, например.
    '''
    def __init__(self, state_algorithm, **kwargs):
        '''
            `state_algorithm` (`алгоритм`): abstract
                алгоритм (или алгоритмы) используемые для проведения расчетов состояния окружения.
                Например функции nx.multi_source_dijkstra
        '''
        self.state_algorithm = state_algorithm

    def __call__(self, env, points, area=None, **kwargs):
        '''
        `**kwargs`:
            Данные которые используются для расчета.
            
            Согласно правилам genesis, должны быть переданы следующие данные:
            
            `env` (`среда`): abstract
                данные среды используемые для проведения расчетов.
                Граф, растр или иное представление пространства, в том числе композитное.

            `points`: list|dict (source)
                Стартовые точки. Может быть списком узлов вида list(int), или словарем вида dict(int:str), где ключ - 
                идентификатор узла, значение - его наименование. 
                Точки должны быть соотносимы с окружением `env`.

            `area` (`область оценки`): abstract = None
                область для которой происходит оценивание метрики.
                ни какие точки являющиеся частью среды `env`, но расположенные
                вне `area` учтены при оценке метрики не будут.

            Конкретный тип данных и их именование в аргументах осуществляются 
            непосредственно при реализации
        '''
        return None


class BestPointsBase:
    '''
    Базовый класс алгоритма расчета лучшей точки
    '''
    def __init__(self, state_function: StateBase, metric_function: MetricBase,  **kwargs) -> None:
        '''
        `state_function`: StateBase
            функция расчета состояния окружения
        `metric_function`: MetricBase
            Функция расчета метрики
        '''
        self.state_function = state_function
        self.metric_function = metric_function

    def __call__(self, env, area=None, **kwargs):
        '''
        `env` (`среда`): abstract
            данные среды используемые для проведения расчетов.
            Граф, растр или иное представление пространства, в том числе композитное.

        `area` (`область оценки`): abstract = None
            область для которой происходит оценивание метрики.
            ни какие точки являющиеся частью среды `env`, но расположенные
            вне `area` учтены при оценке метрики не будут.
        '''
