'''
Классы ядра
'''

import numpy as np


class MetricBase:
    '''
    Базовый класс для Класс-функций расчета метрики по набору данных.
    '''
    def __init__(self, **kwargs):
        '''
        `**kwargs`:
            Основные настройки объекта.

            В наиболее общем случае - функция np.mean,
            которая будет отвечать за расчет значения

            Пользователь может указать собственную функцию.
        '''

    def __call__(self, **kwargs):
        '''
        `**kwargs`:
            Данные которые используются для вычислений.
            
            Например, словарь времен прибытия в разные точки.
        '''
        return None

    @classmethod
    def compare(self, a, b):
        '''
        Сравнение.       
        Возвращает значение в соответствии с логикой расчетов.

        По умолчанию возвращает меньшее
        '''
        return min(a, b)


class EnvStateBase():
    '''
    Базовый класс для класс-функций расчета состояния окружения.

    Лес Вороного, например.
    '''
    def __init__(self, **kwargs):
        pass

    def __call__(self, env, env_alg, source, area=None, **kwargs):
        '''
        `**kwargs`:
            Данные которые используются для расчета.
            
            Согласно правилам genesis, должны быть переданы следующие данные:
            
            `env` (`окружение`): abstract
                данные окружения используемые для проведения расчетов.
                Граф, растр или иное представление пространства, в том числе композитное.

            `env_alg` (`алгоритм`): abstract
                алгоритм (или алгоритмы) используемые для проведения расчетов.

            `source` (`старт`): abstract
                точка (или точки) для которых происходит оценка метрики.
                Точки должны быть соотносимы с окружением `env`.

            `area` (`область оценки`): abstract = None
                область для которой происходит оценивание метрики.
                ни какие точки являющиеся частью окружения `env`, но расположенные
                вне `area` учтены при оценке метрики не будут.

            Конкретный тип данных и их именование в аргументах осуществляются 
            непосредственно при реализации
        '''
        return None









# class trttBase:
#     '''
#     Базовый класс для класс-функций расчета метрики в рассматриваемой точке
#     '''
#     def __init__(self, agg:MetricBase, **kwargs) -> None:
#         self.agg=agg
# # НЕТ НЕ ТАК! Не сама метрика должна считать, а ей передается уже подготовленное состояние окружения, рассчитанное.
#     def __call__(self, env, env_alg, source, area=None, **kwargs):
#         '''
#         `**kwargs`:
#             Данные которые используются для оценки метрики.
            
#             Согласно правилам genesis, должны быть переданы следующие данные:
            
#             `env` (`окружение`): abstract
#                 данные используемые для проведения расчетов.
#                 Граф, растр или иное представление пространства, в том числе композитное.

#             `env_alg` (`алгоритм`): abstract
#                 алгоритм (или алгоритмы) используемые для проведения расчетов.

#             `source` (`старт`): abstract
#                 точка (или точки) для которых происходит оценка метрики.
#                 Точки должны быть соотносимы с окружением `env`.

#             `area` (`область оценки`): abstract = None
#                 область для которой происходит оценивание метрики.
#                 ни какие точки являющиеся частью окружения `env`, но расположенные
#                 вне `area` учтены при оценке метрики не будут.

#             Конкретный тип данных и их именование в аргументах осуществляются 
#             непосредственно при реализации
#         '''
#         return None








