'''
Классы ядра
'''

import numpy as np


class MetricBase:
    '''
    Базовый класс для Класс-функций расчета метрики по набору данных.
    '''
    def __init__(self, **kwargs):
        '''
        `**kwargs`:
            Основные настройки объекта.

            В наиболее общем случае - функция np.mean,
            которая будет отвечать за расчет значения

            Пользователь может указать собственную функцию.
        '''

    def __call__(self, state, **kwargs):
        '''
        `state` (`состояние`): abstract
            Абстрактный объект состояния среды.
            Например, словарь времен прибытия в разные точки.

        `**kwargs`:
            Прочие данные которые используются для вычислений.
            Например, частные настройки алгоритма, дополнительные данные и т.д.

        # Возвращает
        `metric` (`значение метрики`): abstract
            значение метрики
        '''
        return None

    @classmethod
    def compare(self, a, b):
        '''
        Сравнение.       
        Возвращает значение в соответствии с логикой расчетов.

        По умолчанию возвращает меньшее
        '''
        return min(a, b)


class StateBase():
    '''
    Базовый класс для класс-функций расчета состояния среды.

    Лес Вороного, например.
    '''
    def __init__(self, state_algorithm, **kwargs):
        '''
            `state_algorithm` (`алгоритм`): abstract
                алгоритм (или алгоритмы) используемые для проведения расчетов состояния окружения.
                Например функции nx.multi_source_dijkstra
        '''
        self.state_algorithm = state_algorithm

    def __call__(self, env, points, area=None, **kwargs):
        '''
        `**kwargs`:
            Данные которые используются для расчета.
            
            Согласно правилам genesis, должны быть переданы следующие данные:
            
            `env` (`среда`): abstract
                данные среды используемые для проведения расчетов.
                Граф, растр или иное представление пространства, в том числе композитное.

            `points` (`старт`): abstract
                точка (или точки) для которых происходит оценка метрики.
                Точки должны быть соотносимы с окружением `env`.

            `area` (`область оценки`): abstract = None
                область для которой происходит оценивание метрики.
                ни какие точки являющиеся частью среды `env`, но расположенные
                вне `area` учтены при оценке метрики не будут.

            Конкретный тип данных и их именование в аргументах осуществляются 
            непосредственно при реализации
        '''
        return None


class BestPoints:
    '''
    Базовый класс алгоритма расчета лушей точки
    '''
    def __init__(self, state_function: StateBase, metric_function: MetricBase,  **kwargs) -> None:
        '''
        `state_function`: abstract
            функция расчета состояния окружения
        `metric_function`: abstract
            Функция расчета метрики
        '''
        self.state_function = state_function
        self.metric_function = metric_function

    def __call__(self, env, area=None, **kwargs):
        '''
        `env` (`среда`): abstract
            данные среды используемые для проведения расчетов.
            Граф, растр или иное представление пространства, в том числе композитное.

        `area` (`область оценки`): abstract = None
            область для которой происходит оценивание метрики.
            ни какие точки являющиеся частью среды `env`, но расположенные
            вне `area` учтены при оценке метрики не будут.
        '''




# class trttBase:
#     '''
#     Базовый класс для класс-функций расчета метрики в рассматриваемой точке
#     '''
#     def __init__(self, agg:MetricBase, **kwargs) -> None:
#         self.agg=agg
# # НЕТ НЕ ТАК! Не сама метрика должна считать, а ей передается уже подготовленное состояние окружения, рассчитанное.
#     def __call__(self, env, env_alg, source, area=None, **kwargs):
#         '''
#         `**kwargs`:
#             Данные которые используются для оценки метрики.
            
#             Согласно правилам genesis, должны быть переданы следующие данные:
            
#             `env` (`окружение`): abstract
#                 данные используемые для проведения расчетов.
#                 Граф, растр или иное представление пространства, в том числе композитное.

#             `env_alg` (`алгоритм`): abstract
#                 алгоритм (или алгоритмы) используемые для проведения расчетов.

#             `source` (`старт`): abstract
#                 точка (или точки) для которых происходит оценка метрики.
#                 Точки должны быть соотносимы с окружением `env`.

#             `area` (`область оценки`): abstract = None
#                 область для которой происходит оценивание метрики.
#                 ни какие точки являющиеся частью окружения `env`, но расположенные
#                 вне `area` учтены при оценке метрики не будут.

#             Конкретный тип данных и их именование в аргументах осуществляются 
#             непосредственно при реализации
#         '''
#         return None








