'''
Швейцарский нож.

Думаю не нужен!

Глобальные инструменты и настройки системы, которые могут быть изменены пользователем

## Функции
`single_source_forward_path_length (ssfpl)`: алгоритм прямого расчета времени прибытия 
    во все узлы графа от единого источника.
`multi_source_forward_path_length (msfpl)`: алгоритм прямого расчета времени прибытия 
    во все узлы графа от множества источников.

## Переменные
`delay_time`: Время обработки вызова. 
    (то время которое проходит с момента поступления сообщения до момента выезда сил и средств)
'''

import networkx as nx

# class Functions(object):
#     '''
#     Функции используемые при проведении расчетов
#     '''
ssfpl = nx.single_source_dijkstra_path_length
msfpl = nx.multi_source_dijkstra_path_length


delay_time = 1
