'''
Инструменты обработки графов, моделей и данных. Обрезка, соединение, сохранение, загрузка
'''


# Блок простых инструментальных функций общего назначения
def kmh_to_mm(kmh: float, precision: int = 2):
    '''
    Перевод километров в час в метры в минуту

    Аргументы
    ---------
    `kmh`: float
        Скорость в километрах в час

    `precision`: int
        Точность округления, знаков после запятой

    Возвращает
    ----------
    `mm`: float
        Скорость в метрах в минуту
    '''
    if not isinstance(kmh, (int, float)):
        raise TypeError("Аргумент kmh должен иметь тип данных int или float")

    return round(kmh*1000/60, precision)
