"""
genesis
========

genesis - это библиотека для проведения расчетов в области организационного проектирования
экстренных аварийно-спасательных служб (ЭАСС).

genesis позволяет проводить расчеты оптимального распределения границ зон обслуживания ЭАСС.
При этом пользователь может самостоятельно выбирать конкретные подходы и методы проведения расчетов
для конкретных случаев.
"""



# from ._api import *
from ._version import __version__


# from . import algorithms
# from . import tools

# Тесты - при публикации закомментировать!
# from . import tests
